ТОИР_демо/src/Catalogs/торо_ПредопределенныеСценарииРаботыСистемы/торо_ПредопределенныеСценарииРаботыСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ПредопределенныеСценарииРаботыСистемы</name>
  <predefined>
    <items>
      <name>ПаспортизацияОборудования</name>
      <description>Паспортизация оборудования</description>
    </items>
    <items>
      <name>ПолныйФункционал</name>
      <description>Полный функционал</description>
    </items>
  </predefined>
  <attributes>
    <name>торо_ИспользоватьСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУведомленияОСобытияхСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетЗапчастей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьТиповыеОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСложныеТехКартыРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНаправленияОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьГарантии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьДокументыПринятияИСписанияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетКонтролируемыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетНаработкиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетСостоянияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетПусковОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетВыявленныхДефектовОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_УчетЗамещающихРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьРегламентныеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьПланированиеПоЖесткимРемЦиклам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользованиеЛимитовРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОценкиРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РассчитыватьПлановуюСтоимостьРемонтовПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьЛоты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСметыРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьРемонтыПоСостоянию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОбщийПланРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВнешниеОснованияДляРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядыНаВыполнениеРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьВозможностьОтменыРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьАналогиНоменклатурыДляРемонтов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУправлениеПерсоналом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСтатусыДокументовТОиР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьКонтрольОтрицательныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНастраиваемыеПредставления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_РазрешитьПользовательскуюНастройкуПредставлений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартнеровИКонтрагентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ВыделятьИнвестиционныеРемонты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьУпрощеннуюФормуДефекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьФоновыйРасчетППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОстановочныеРемонты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьОпасноеПроизводство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ЗапретитьПроведениеАктовСИсполнителямиБезУказанияКвал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьАктПриемкиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ИспользоватьНарядыНаРегламентноеМероприятие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_ПоказыватьПодсистемуKPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВводНаОсновании</name>
    <attributes>
      <name>ПараДокументов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/Catalogs/торо_ПредопределенныеСценарииРаботыСистемы/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать(Истина);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выбрать(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		СтруктураВозврата = ПолучитьСтруктуруВозвратаНаСервере(ТекущиеДанные.Ссылка);
		Оповестить("ОБРАБОТКА_ВЫБОРА_СЦЕНАРИЯ", СтруктураВозврата);
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ПолучитьСтруктуруВозвратаНаСервере(Ссылка)
	
	Структура = Новый Структура();
	Структура.Вставить("Ссылка", Ссылка);

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьСогласование,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьУведомленияОСобытияхСистемы,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_УчетЗапчастей,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьТиповыеОР,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьСложныеТехКартыРемонтов,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьНаправленияОР,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьГарантии,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьДокументыПринятияИСписанияОборудования,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_УчетКонтролируемыхПоказателей,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_УчетНаработкиОборудования,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_УчетСостоянияОборудования,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_УчетПусковОборудования,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_УчетВыявленныхДефектовОборудования,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьППР,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_УчетЗамещающихРемонтов,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьКоэффициентыРемонтныхОсобенностей,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьРегламентныеМероприятия,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьПланированиеПоЖесткимРемЦиклам,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользованиеЛимитовРемонтов,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьОценкиРМ,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_РассчитыватьПлановуюСтоимостьРемонтовПриПланировании,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьЛоты,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьСметыРемонта,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьРемонтыПоСостоянию,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьОбщийПланРабот,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьВнешниеОснованияДляРабот,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьНарядыНаВыполнениеРабот,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьВозможностьОтменыРемонтов,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьУсложненнуюСхемуЗакрытияНарядов,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьАналогиНоменклатурыДляРемонтов,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьУправлениеПерсоналом,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьСтатусыДокументовТОиР,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьКонтрольОтрицательныхОстатков,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьНастраиваемыеПредставления,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_РазрешитьПользовательскуюНастройкуПредставлений,
		|	торо_ПредопределенныеСценарииРаботыСистемы.ИспользоватьПартнеровИКонтрагентов,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ВыделятьИнвестиционныеРемонты,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьСтандартныеОповещенияОПревышенииПоказателей,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьУпрощеннуюФормуДефекта,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьФоновыйРасчетППР,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьОстановочныеРемонты,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьНарядДопускНаРаботыПовышеннойОпасностиОбязательно,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьОпасноеПроизводство,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ЗапретитьПроведениеАктовСИсполнителямиБезУказанияКвал,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьАктПриемкиОборудования,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ИспользоватьНарядыНаРегламентноеМероприятие,
		|	торо_ПредопределенныеСценарииРаботыСистемы.торо_ПоказыватьПодсистемуKPI,
		|	торо_ПредопределенныеСценарииРаботыСистемы.Предопределенный
		|ИЗ
		|	Справочник.торо_ПредопределенныеСценарииРаботыСистемы КАК торо_ПредопределенныеСценарииРаботыСистемы
		|ГДЕ
		|	торо_ПредопределенныеСценарииРаботыСистемы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ПредопределенныеСценарииРаботыСистемыВводНаОсновании.ПараДокументов,
		|	торо_ПредопределенныеСценарииРаботыСистемыВводНаОсновании.Значение
		|ИЗ
		|	Справочник.торо_ПредопределенныеСценарииРаботыСистемы.ВводНаОсновании КАК торо_ПредопределенныеСценарииРаботыСистемыВводНаОсновании
		|ГДЕ
		|	торо_ПредопределенныеСценарииРаботыСистемыВводНаОсновании.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТЗКонстант = РезультатЗапроса[0].Выгрузить();
	
	Структура.Вставить("Предопределенный", Ложь);
	
	Если ТЗКонстант.Количество() > 0 Тогда
		
		СтрокаТаблицы  = ТЗКонстант[0];
		
		Структура.Предопределенный = СтрокаТаблицы.Предопределенный;

		КолонкиТаблица = ТЗКонстант.Колонки;
		СтруктураКонстант = Новый Структура;
		
		Для каждого Колонка Из КолонкиТаблица Цикл
			
			ИмяКолонки = Колонка.Имя;
			
			Если ИмяКолонки = "Предопределенный" Тогда
				Продолжить;
			КонецЕсли; 
			
			СтруктураКонстант.Вставить(ИмяКолонки, СтрокаТаблицы[ИмяКолонки]);
			
		КонецЦикла;
		
		Структура.Вставить("МассивСтруктурЗначенийКонстант", СтруктураКонстант);
		
	КонецЕсли; 
	
	ТЗВводНаОсновании = РезультатЗапроса[1].Выгрузить();

	Если ТЗВводНаОсновании.Количество() > 0 Тогда
		
		Соответствие = Новый Соответствие;
		
		Для каждого Строка Из ТЗВводНаОсновании Цикл
			Соответствие.Вставить(Строка.ПараДокументов,Строка.Значение);
		КонецЦикла;
		Структура.Вставить("СоответствиеВводНаОсновании", Соответствие);
	КонецЕсли; 
	
	
	Возврат Структура;

КонецФункции
#КонецОбласти
